ArtMoney Plugin
8.17
Polskie tłumaczenie [wersja 1.1]:
Marcin "Berłoś" Berłowski
grendel13@o2.pl
O programie
Oszukiwacz do Gier
<d> <ms> <yyyy>
Prawa Autorskie (C) 1996-2021, System SoftLab
Jeśli znalazłeś jakiekolwiek błędy lub
masz jakieś sugestie, wyślij e-mail na adres
Odwiedź stronę ArtMoney, aby pobrać najnowszą wersję
Wartość
Szukaj
Filtruj
Liczba wartości
Na początku wybierz proces gry
Teraz rozpocznij szukanie w procesie
Filtruj znalezione liczby, dopóki ich ilość nie będzie się zmniejszać
Niestety nic nie odnaleziono. Spróbuj ponownie.
Wyłącz
Znaleziono
adresy(ów)
adresy(ów)
adres
W tabeli
Błąd ładowania
Błąd szukania
Błąd filtrowania
Nieobsługiwany format pliku
Niewłaściwa wartość dla wybranego typu 
Nie mogę wczytać
Proces szukania
Proces filtrowania
Wszystkie możliwości
bajt
bajt
bajty
Niewłaściwa metoda. Spróbuj innej.
sek.
min
Nie wybrano typu dla tej metody
Wpisz wielkość, która nie będzie większa niż
została zmieniona
pozostała niezmieniona
została zwiększona
została zmniejszona
Ta tabela została stworzona w nowszej wersji
Ta tabela jest uszkodzona
Błąd dostępu do pliku
Całkow. 1 bajt//Całkow. - wartości całkowite
Całkow. 2 bajty
Całkow. 3 bajty
Całkow. 4 bajty
Całkow. 8 bajtów
Zmienn. 4 bajty//Zmienn. - wartości zmiennoprzecinkowe
Zmienn. 6 bajtów
Zmienn. 8 bajtów
Zmienn. 10 bajtów
Tekst
Ciąg znaków zakończony znakiem null
Pusty ciąg znaków
Pascalowy ciąg znaków
Odwr.Całkow. 2 bajty//Odwr. - wartości odwrotne np. 10111 na 01000
Odwr.Całkow. 3 bajty
Odwr.Całkow. 4 bajty
Odwr.Całkow. 8 bajtów
Odwr.Zmienn. 4 bajty
Odwr.Zmienn. 6 bajtów
Odwr.Zmienn. 8 bajtów
Odwr.Zmienn. 10 bajtów
Odwr.Tekst
Odwrócony pusty ciąg znaków
Odwrócony Pascalowy ciąg znaków
Styczeń
Luty
Marzec
Kwiecień
Maj
Czerwiec
Lipiec
Sierpień
Wrzesień
Październik
Listopad
Grudzień
Z//Z=Zamrożenie
Pomoc
O programie
Wybierz proces
Wyczyść
Wczytaj
Zapisz
Dodaj
Dodaj wszystko
Edytuj
Kopiuj
Kasuj
Zamroź
Odmroź
Autonanoszenie przesunięcia adresu
Informacje
Rodzaj gry
Czas zamrażania [ms]
Czas odświeżenia [ms]
Język
Pokaż podaną liczbę adresów
Klawisz powrotu do okna ArtMoney
Ogólne
Dodatkowe
Osobiste
E-mail
Domyślny komentarz
System operacyjny
Format dziesiętny
Układ bajtów
Priorytet skanowania
Wysoki
Maksymalny
Opcje
Zrezygnuj
Normalny
Edytuj adres
Zamróź
Wielkość
Adres
Opis
Typ
Odwróć wartości
Dokładna wartość
Kolejne wartości
Zakres wartości
Nieznana wartość
Zakodowana wartość
Własny
Wybierz typ
Układ bajtów
Normalny i odwrócony
Wszystkie
Całkowity
Zmiennoprzecinkowy
Czas od startu:
Czas do końca:
Prędkość:
Znaleziono:
Gra
Komentarz
Data
System
Informacje o tabeli
Stworzył
Nazwa
Lokalizacja
Sekwencja wejściowa
Klawisz ustawień
Odwrócony
Szukaj w tym bloku pamięci
Szukaj tylko w zakresie adresów pamięci
Oszczędzaj przestrzeń dyskową
od
do
Szukaj
Filtruj
Krok
Krok//Ustaw wartość
Ustaw wartość
Zaznacz wszystko
AUTO
Pokaż procesy
Widoczne
Tylko z Windowsów
Informacja o procesie
Zakończ proces
Pokaż okno
Ukryj okno
Na pewno chcesz zakończyć proces?
Dostęp wzbroniony
Nie można zakończyć procesu
Nazwa pliku
Typ procesu
Wielkość danych
Pomiar
Pomiar prędkości skanowania pamięci
Czekaj
Twój komputer
Specjalne klawisze skrótów
Dodaj do wartości
Zablokuj to okno
Włącz Cofanie/Ponawianie filtrowania
Wygląd liczb całkowitych
bez znaku//pierwszy bit z pierwszego bajtu jest liczbą
znakowy//pierwszy bit z pierwszego bajtu jest znakiem
Cofanie filtrowania
Ponawianie filtrowania
Zapisz filtrowanie
Wczytaj filtrowanie
Aktualny krok jest
"Cofanie filtrowania" niewłączone
"Ponawianie filtrowanie" niewłączone
"Ładowanie filtrowania" niewłączone
została zwiększona o
została zmniejszona o
Wygląd programu
Klawisze skrótów
Klawisze skrótów włączone
Domyślne klawisze skrótów
Czcionka główna
Czcionka tabel
Kolor paneli
Kolor wypełnień paneli
Kolor przycisków
Przyciski w kształcie elips :)
OK
Edytor pamięci
Widok heksadecymalny
Edycja heksadecymalna
Liczba kolumn z wartościami
Widok komórki
Aktualna komórka
Poruszanie się po
Poruszanie się po wynikach szukania
Poruszanie się po tabeli
Poruszanie się po bloku pamięci
Poruszanie się po adresach
Pierwszy
Wcześniejszy
Kolejny
Ostatni
Ogółem
Aktualny
Kopiuj ten obszar
Wstaw ten obszar
Dodaj do tabeli
Wszystkie (standard)
Całkowite (standard)
Zmiennoprzecinkowe (standard)
Odwróć zaznaczone
Równaj kolumny
<Nie>
Wskaźnik//Pointer
Odśwież
Edytuj wybrane
Grupa
Widoczna grupa
Zaznacz wybraną grupę
Zapisz ten adres/wskaźnik
Autonanoszenie przesunięcia dla wszystkich
Autonanoszenie przesunięcia dla grup
Autonanoszenie przesunięcia z zapisem wszystkich adresów
Autonanoszenie przesunięcia z zapisem adresów grup
Polecenia ze wskaźnikami
Ustaw wskaźnik dla wszystkich
Ustaw wskaźnik dla grup
Ustaw zapisany wskaźnik dla wszystkich
Ustaw zapisany wskaźnik dla grup
Ustaw wskaźniki adresów
Ustaw wskaźniki do zapisanych adresów
Szukaj wskaźnika dla adresu
Szukaj wskaźnika do początku bloku pamięci
Sortuj
Sortuj wg opisów
Sortuj wg adresów
Sortuj wg wartości
Sortuj wg wartości jako tekst
Sortuj wg grup
Łącz
Błąd łączenia
Obie tabele muszą być stworzone przez jednego autora
Wybierz aktualny proces
Kod znaku
Pokaż widoczną grupę na panelu
w grupie
Zmień wskaźniki do adresów
Ustaw filtr
Ciąg znaków
<Nie odnaleziono pliku>
<Błąd dostępu>
Edytor plików
Błędy
<Zmieniła się wielkość>
Skórka
Brak skórki
Zmień czcionkę
Kolor tabel
Zrób zrzut pamięci
Przez formułę
Proces
Zatrzymaj proces
Przywróć proces
Zapisz proces
Wczytaj proces
ID procesu
Wątki
Plik(i)
Informacja o pliku(ach)
Wybierz plik
Wybierz katalog
Ilość plików
Całkowita wielkość
Poruszanie się po katalogu
Obiekt
Tabela
Wyjście
Rezultat
Więcej
Kup "ArtMoney PRO" poprzez Internet
Odwiedź Stronę Domową programu
Podręcznik do programu ArtMoney
Kodowanie
Wybierz kodowanie
Jasność
Odcień
Pokaż menu główne
Używaj nieoficjalnych wtyczek językowych
Zatrzymaj proces podczas filtrowania
Zapisz/Wczytaj wartości do/z pliku-tabeli
Biblioteka dla przeglądarki procesów
Opcje katalogów
Maska nazwy pliku
Data modyfikacji
Data pliku
Czas pliku
Nie sprawdzaj
Ostatnie 15 min
Ostatnia godzina
Ostatni dzień
Ostatni miesiąc
Ostatni rok
Więcej niż
Mniej niż
Ta opcja jest dostępna tylko w edycji ArtMoney PRO
Tylko w ArtMoney PRO
Umowa Licencyjna
Zgadzam się z warunkami i postanowieniami Umowy Licencyjnej
O edycji PRO
Podziękowania specjalne
za stworzenie podręcznika użytkownika
za logo
za moduł startowy
za stworzenie ikonek
za sprawdzenie gramatyki w angielskiej wersji podręcznika
za pomoc
za silnik skórek (paczka ThemeEngine)
za rady i wartościowe wskazówki
za tłumaczenia
za tabele
Numer Rejestracyjny
Niezarejestrowany
Nie pytaj się więcej o hasło
Tylko dla bieżącego użytkownika Windows
Zatrzymaj proces i przywróć ArtMoney
Wróć i wznów proces
Zbędny nawias zamykający
Potrzebny nawias zamykający
Zbędny cudzysłów
Nieprawidłowy ID
Nieprawidłowa liczba argumentów (M1,M2...)
Nieprawidłowa liczba operacji (-,+)
Nieprawidłowa liczba warunków (<,>,=)
Nieprawidłowa liczba wyrażeń
Nieprawidłowe wyrażenie
Ten krok nie istnieje
Nieprawidłowy warunek
Nieprawidłowy parametr dla
Brak warunków
Poszukiwanie
Rejestrowanie
Hasło
Wpisz proszę hasło i naciśnij "OK"
Hasło nieprawidłowe
Nieprawidłowy lub zbyt stary plik-klucz
Brak pliku-klucza
Domyślne
Zatrzymane przez użytkownika
Język podręcznika
Nie znaleziono procesu
Odśwież wartości w tablicy tylko w aktywnym oknie
Wielkość kodu
Mapa procesu
Adres regionu
Stan
Zabezpieczenie regionu
Zabezpieczenie
Nazwa modułu
Ta opcja działa tylko pod Windows 2000/XP/2003/VISTA/2008/7/8/2012/10
Zapisz/Wczytaj proces
Tryb
Nieprawidłowy proces. Proces został zmieniony lub ponownie uruchomiony.
Zamknij
W Excelu
Zaokrąglij wartości zmiennoprzecinkowe
Macromedia Flash
Zakres
Zatrzymaj proces w pamięci
Zarezerwowany obszar fizyczny pamięci
Uruchom nowy proces
Zainstaluj
Stwórz skrót na pulpicie
Ukryj proces
Pokaż proces
Emulator
System gry
Zakres adresów
Użyj opcji emulacji
Mapa pamięci emulatora
Adres Emul.
Adres PC
Czy chcesz przekształcić adres emulatora do adresu PC?
Czy chcesz przekształcić adres PC do adresu emulatora?
Błąd konwersji adresu
Automatycznie wybierz emulator używając nazwy pliku
Grupy
Pokaż drzewo grup
Żaden
Lewy
Prawy
Nowa grupa
Główny
Język
Czy chcesz skasować ten język?
Czy chcesz dodać nowy język?
Czy chcesz zmienić nazwę języka?
zwykłe zamrożenie
może wzrosnąć
może zmaleć
od minimum do maksimum
Minimum
Maksimum
Skopiuj zaznaczone
Pobierz "Spyware Process Detector"
Program "Spyware Process Detector" nie został znaleziony na tym komputerze. Możesz go pobrać i zainstalować używając strony internetowej naszej firmy: www.systemsoftlab.com. Program może współpracować z ArtMoney jako selektor procesów. Używając "Spyware Process Detector", możesz otwierać dowolne ukryte procesy lub takie, które blokują do siebie dostęp. Program podaje szczegółowe informacje na temat działających na tym komputerze procesów i wykrywa wirusy, trojany i programy szpiegujące (także takie, niewykrywalne przez programy antywirusowe).
Wyślij sugestie lub zgłoś znalezione błędy na adres
Odwiedź naszą firmową stronę i pobierz inne programy
To jest darmowa LIMITOWANA wersja. Pełną wersję możesz kupić za tylko 99 Polish Zlotych. Jest to jednorazowa opłata - ulepszenia są darmowe!
Tylko zarejestrowani użytkownicy mają prawo do pełnego wsparcia ze strony działu technicznego oraz posiadają dostęp do wszystkich dodatkowych udogodnień.
Aby dokonać zakupu upewnij się, że jesteś podłączony do internetu i kliknij poniżej na przycisk "Zarejestruj się elektronicznie".
Zarejestruj się elektronicznie
Instalacja usług
System Windows potrzebuje autoryzacji użytkownika w celu instalacji usług
Zainstaluj jako wybrany użytkownik
Użytkownik
Domena
Błąd instalacji usług. Brak dostępu.
Nie powiodło się logowanie użytkownika
Tryb ukryty
Ukryj mój proces
Ukryj moje okno
Zainstalowana stara wersja usług. Uruchom ponownie komputer, aby zainstalować nową wersję.
Tabela została zmieniona
Czy chcesz zachować wprowadzone zmiany?
Pytaj o zachowanie zmian w tabeli przy wychodzeniu z programu
Struktura
Pominięte
Pole
Limit wielkości struktury do
Element
Nowy element
Przeszukaj strukturę tabeli
Przeszukaj strukturę grupy
Przeszukaj strukturę tabeli wybranych adresów
Idź w górę
Idź w dół
Dostań "ArtMoney PRO" za darmo
za sprawdzenie gramatyki w rosyjskim podręczniku do programu
Typ zaokrąglania
Zaokrąglij do najbliższego
Zaokrąglij w dół
Zaokrąglij w górę
Zaokrąglij w stronę zera
Dalej
Dostań za darmo
Deasembler
Rozkaz asemblerowy
Adresowanie modułów
Moduł
Adres w module
Błąd konwersji
Nie mogę przekształcić adresu modułu: Nie ma takiego modułu w procesie.
Filtruj pamięć modułów systemowych
Filtruj pamięć modułów współdzielonych
Błąd otwierania procesu
Nie można otworzyć procesu.
Spróbuj użyć wersji PRO.
Dla tej tabeli potrzebujesz wersji PRO.
Nieprawidłowy rejestr
Nieprawidłowy adres
Nieprawidłowa wartość
Zbyt duża wartość
Nieprawidłowy rozkaz asemblerowy
Jednokrotnie uruchom program ArtMoney jako administrator. Aby to zrobić, kliknij prawym przyciskiem na ikonie skrótu programu ArtMoney i wybierz opcję "Uruchom jako... Administrator" z menu.
Błąd uruchamiania usług
Błąd otwierania usług
Spróbuj ponownie uruchomić komputer
została zmieniona o
Konwersja tabeli
Czy chcesz przekształcić tą tabelę do trybu 64-bitowego?
Czy chcesz przekształcić tą tabelę do trybu 32-bitowego?
Wystąpił błąd konwersji. Program nie może przekształcić adresów do trybu 32-bitowego.
Podzielność adresów
Parzyste
Nieparzyste
Podzielne przez 4
Podzielne przez 8
Podzielne przez 16
Filtruj tylko adresy statyczne w modułach
Wyświetl opcje modułu
Wpisz kod rejestracyjny
Wklej kod rejestracyjny (użyj skrótu Ctrl-V albo przycisku "Wklej") i naciśnij przycisk "OK"
Wklej
Kod rejestracyjny jest nieprawidłowy
Ten kod rejestracyjny pasuje tylko do wersji angielskiej programu
Ten kod rejestracyjny pasuje tylko do wersji rosyjskiej programu
Ten kod rejestracyjny pasuje tylko do starszej wersji programu
Ten kod rejestracyjny przestał działać. Skontaktuj się proszę z sales@systemsoftlab.com, aby otrzymać nowy kod.
Jeśli nie widzisz tu swojego imienia i nazwiska, możliwe że używasz pirackiej lub kradzionej wersji programu, która może przez to działać nieprawidłowo!
Wskaźnik-do-Wskaźnika
Maksymalne przesunięcie adresu
Poziom z
Poszukaj wskaźnika do wskaźnika
Maksymalnie 2 poziomy dla wersji SE!
Spróbuj wyłączyć wymaganie podpisu elektronicznego dla sterowników
Szybki tryb (zużywa więcej pamięci)
Mb
Automatycznie zastosuj przesunięcie i skopiuj je do nowej grupy
Adres w bloku
Konwersja adresu w bloku jest niemożliwa: Nie ma takiego bloku w procesie.
Problem z konwersją: Rozmiar bloku nie jest unikatowy.
Sortuj wskaźniki wedle przesunięcia
Nie pokazuj tekstu dla trybu ukrytego//Tylko w wersji VIP
Kup lub sprzedaj konta poprzez Internet
Nowa wersja jest dostępna do ściągnięcia
Sprawdź dostępność nowej wersji
Wskaźnik z przesunięciem
Szukaj wskaźnika z maksymalnym możliwym przesunięciem
możliwe do 2 poziomu
Formuła
Wersja
Zawsze na wierzchu
Włącz "Zawsze na wierzchu"
Wyłącz "Zawsze na wierzchu"
Sprawdź swoje połączenie internetowe! Otwarcie strony systemsoftlab.com było niemożliwe.
Spróbuj ustawić opcje
Nazwa/Moduł
Heksadecymalnie
Rejestr
Flaga
Dołącz debuger
Odłącz debuger
Czy chcesz dołączyć debuger do wybranego procesu?
Lista punktów przerwania
Komendy
Debugowanie
Zachowaj informacje z debugowania
Wczytaj informacje z debugowania
Asembler
x86 32-bitowy
x86 64-bitowy
Punkt przerwania
Dodaj punkt przerwania
Usuń punkt przerwania
Uruchom
Uruchom do
Aż do zwrócenia
Śledź krok
Śledź następny krok
Ustaw nazwę adresu
Usuń nazwę adresu
Tak
Nie
Typ debugera
Standardowy
Obsługa wyjątków
Wykonywalny typ punktu przerwania
Oprogramowanie (instrukcje int3)
int3
Debuguj rejestry (maks. 4)
rejestr
Wyjątki strony
wyjątki
Dostęp do typu punktu przerwania
Pytaj o dołączanie debugera do procesu
Użyj punktów przerwania oprogramowania, jeśli użyte są wszystkie rejestry debugowania
Automatycznie Zachowuj/Wczytuj informacje z debugowania
Użyj symboli debugowania
Ścieżka do symboli
Aktywny
Przerwanie
Uruchomienie
Dowolny dostęp
Zapisz
Warunki
Zmiany
Włącz WSZYSTKO
Wyłącz WSZYSTKO
Znajdź instrukcję uzyskującą dostęp do adresu
Na dostępie do pamięci
Na zapisie pamięci
Błąd warunków
Błąd zmian
Dzielenie przez zero
Błąd odczytu
Błąd zapisu
Błędna lewa strona
Start
Stop
Dostęp
Wyczyść wyniki
Podziel na wątki
Numer
Wątek
8-bitowy
16-bitowy
32-bitowy
Heksadecymalnie
Heksad
Float4
Float8
Sekwencja heksadecymalna
Serwer systemsoflab.com nie odpowiada lub nie ma połączenia internetowego
Podany kod rejestracyjny jest zakazany
Możesz aktywować ten kod tylko 2 razy dziennie
Kod rejestracyjny działa tylko z edycją VIP
Ukryj obecność debugera
Zachowaj tabelę w kodzie Unicode
Uzyskaj rozmiar aż do końca działania funkcji (do powrotu)
Licencje
Skanuj obszary pamięci
data zapisywalny
dane tylko do odczytu
kod zapisywalny
kod tylko do odczytu
dzielony/a
system
chroniony/a
ukryty/a
Ilość wystąpień każdego adresu
Nazwy adresów i listy symboli
Symbole katalogów
Nazwy użytkowników
Ważna wielkość liter
Całe słowa
Pierwsza pozycja
Zapis/Odczyt
Wykrywaj wielkość funkcji
Ukryj rejestry debugera
Popraw tę funkcję (strukturę)
Pomija zabezpieczenia procesu
Użyj własnych funkcji dostępu do pamięci
Tryb funkcji użytkownika (dołącz do procesu)
Tryb funkcji jądrą (poprzez sterownik)
Dołącz do procesu bez OpenProcess
Sygnatury
Szukaj sygnatur
Dodaj sygnaturę
Offset
Automatyczne szukanie
Adres statyczny
Regiony
Edytuj jako kod Assemblera
Jako kod Assemblera
Konwertuj do HEX
Limituj niepowtarzalne offsets na poziom
Zamiana kodu
Zamień kod
Jednoczesna zamiana kodu
<ZMIENIONY>
<NIEZMIENIONY>
<NIE MODUŁ>
<NIE BLOK>
<NIE SYFNATURA>
<NIE ZMIENNA>
Wstrzykiwanie kodu
Wstrzyknij kod
Tyko w przypadku poprawnej zamiany kodu
Automatycznie zamień cały kod i wstrzyknij
Pozwól na automatyczne zamienienie całego kodu i wstrzykiwanie
Pytaj o pozwolenie na automatyczne zamienienie całego kodu i wstrzykiwanie
Tabela zawiera kod do wstrzyknięcia i zamiany. Może być on złośliwy! Pobieraj tabele tylko z zaufanych stron! Czy na pewno chcesz wstrzyknąć ten kod do procesu?
Zamień cały kod i wstrzyknij
Anuluj zamiane całego kodu i wstrzykiwanie
Sygnatura
Oryginalna Sygnatura
Niepoprawna oryginalna sygnatura
Adres sygnatury//pełny
Adres sygnatury//krótki
Adres zmiennej//pełny
Adres zmiennej//krótki
Nie mogę przetworzyć adresu sygnatury: Nie ma takiej sygnatury.
Nie mogę przetworzyć adresu zmiennej: Nie ma takiej zmiennej.
Nazwa//zmienna lub etykieta
Wielkość kodu do zamiany
Jedna instrukcja assemblera
Kilka instrukcji assemblera
Linia
Błąd względnego adresowania (zbyt duży offset)
Nieprawidłowy mnożnik
Błąd skoku powrotnego
Nie można przydzielić pamięci
Obszary//Obszary pamięci
Ustaw adres lustrzany
Wyczyść adres lustrzany
od adresu minimalnego
Serwis
Pokaż offset wskaźnika w HEX
Użyj rejestru RAX(EAX). Tylko instrukcje MOV z rejestru RAX(EAX) mogą czytać/zapisywać adresy bezwzględne!
Zmień szybkość procesu
Twoja szybkość (%)
Normalna//Szybko
Błąd zmiany szybkości procesu
Zwiększ szybkość procesu
Zmniejsz szybkość procesu
Stos
Obejrzyj jako stos
Zapisz stos wątku
Adres zwrotny
Parametr
Parametry
Pokaż parametry w jednej linii
Adres zwrotny tylko w module
Błąd odczytu pamięci
Digits after a decimal point (Fractional part)//full
Digits a.//short
Masks
Read mask
Write mask
Use mask type
<MASK ERROR>
Server sent an invalid response or bad internet connection
stacks
Use stack of the threads as module name
Limit the number of threads
Stack of thread
64-bit stack of thread
Temp files folder
Current user folder
Program folder
Another folder
Temp folder error
Temp folder does not exist and could not be created
Last digits
D4046D93